; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v5 ?v11)
             (pred_5 ?v6 ?v10)
             (pred_2 ?v5 ?v10)
             (pred_11 ?v9 ?v5 )
	     (pred_10 ?v5)
             (pred_7 ?v3)
             (pred_9 ?v6)
             (pred_8 ?v10)
             (pred_3 ?v5)
             (pred_12 ?v6)
             (pred_4 ?v5)
             (pred_6 ))



(:action op_3
:parameters (?v1 ?v4 ?v7 ?v12)
:precondition (and (pred_7 ?v1) (pred_7 ?v4) (pred_9 ?v7) (pred_8 ?v12)
          (pred_1 ?v1 ?v4) (pred_5 ?v7 ?v12)
                   (pred_2 ?v4 ?v12) (pred_10 ?v1) 
                   (pred_3 ?v4) (pred_12 ?v7))
:effect (and  (pred_4 ?v4) (not (pred_3 ?v4))))


(:action op_1
:parameters (?v1 ?v13)
:precondition (and (pred_7 ?v1) (pred_7 ?v13)
               (pred_10 ?v1) (pred_1 ?v1 ?v13) (pred_4 ?v13))
:effect (and (pred_10 ?v13) (not (pred_10 ?v1))))

(:action op_4
:parameters (?v1 ?v7)
:precondition (and (pred_7 ?v1) (pred_9 ?v7) 
                  (pred_10 ?v1) (pred_11 ?v7 ?v1) (pred_6 ))
:effect (and (pred_12 ?v7)
   (not (pred_11 ?v7 ?v1)) (not (pred_6 ))))


(:action op_2
:parameters (?v1 ?v8 ?v2)
:precondition (and (pred_7 ?v1) (pred_9 ?v8) (pred_9 ?v2)
                  (pred_10 ?v1) (pred_12 ?v2) (pred_11 ?v8 ?v1))
:effect (and (pred_12 ?v8) (pred_11 ?v2 ?v1)
        (not (pred_12 ?v2)) (not (pred_11 ?v8 ?v1))))

(:action op_5
:parameters (?v1 ?v7)
:precondition (and (pred_7 ?v1) (pred_9 ?v7) 
                  (pred_10 ?v1) (pred_12 ?v7))
:effect (and (pred_6 ) (pred_11 ?v7 ?v1) (not (pred_12 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_05 obj_20 obj_08 obj_03 obj_06 obj_12 obj_17 obj_10 obj_07 obj_09 obj_02 obj_15 obj_13 obj_18 obj_04
    obj_01 obj_14
    obj_11 obj_16
    )

    (:init
       (pred_6)

       (pred_7 obj_19)
       (pred_7 obj_05)
       (pred_7 obj_20)
       (pred_7 obj_08)
       (pred_7 obj_03)
       (pred_7 obj_06)
       (pred_7 obj_12)
       (pred_7 obj_17)
       (pred_7 obj_10)
       (pred_7 obj_07)
       (pred_7 obj_09)
       (pred_7 obj_02)
       (pred_7 obj_15)
       (pred_7 obj_13)
       (pred_7 obj_18)
       (pred_7 obj_04)
       (pred_8 obj_01)
       (pred_8 obj_14)
       (pred_9 obj_11)
       (pred_9 obj_16)

       (pred_1 obj_19 obj_03)
       (pred_1 obj_19 obj_05)
       (pred_1 obj_05 obj_06)
       (pred_1 obj_05 obj_20)
       (pred_1 obj_05 obj_19)
       (pred_1 obj_20 obj_12)
       (pred_1 obj_20 obj_08)
       (pred_1 obj_20 obj_05)
       (pred_1 obj_08 obj_17)
       (pred_1 obj_08 obj_20)
       (pred_1 obj_03 obj_10)
       (pred_1 obj_03 obj_06)
       (pred_1 obj_03 obj_19)
       (pred_1 obj_06 obj_07)
       (pred_1 obj_06 obj_12)
       (pred_1 obj_06 obj_05)
       (pred_1 obj_06 obj_03)
       (pred_1 obj_12 obj_09)
       (pred_1 obj_12 obj_17)
       (pred_1 obj_12 obj_20)
       (pred_1 obj_12 obj_06)
       (pred_1 obj_17 obj_02)
       (pred_1 obj_17 obj_08)
       (pred_1 obj_17 obj_12)
       (pred_1 obj_10 obj_15)
       (pred_1 obj_10 obj_07)
       (pred_1 obj_10 obj_03)
       (pred_1 obj_07 obj_13)
       (pred_1 obj_07 obj_09)
       (pred_1 obj_07 obj_06)
       (pred_1 obj_07 obj_10)
       (pred_1 obj_09 obj_18)
       (pred_1 obj_09 obj_02)
       (pred_1 obj_09 obj_12)
       (pred_1 obj_09 obj_07)
       (pred_1 obj_02 obj_04)
       (pred_1 obj_02 obj_17)
       (pred_1 obj_02 obj_09)
       (pred_1 obj_15 obj_13)
       (pred_1 obj_15 obj_10)
       (pred_1 obj_13 obj_18)
       (pred_1 obj_13 obj_07)
       (pred_1 obj_13 obj_15)
       (pred_1 obj_18 obj_04)
       (pred_1 obj_18 obj_09)
       (pred_1 obj_18 obj_13)
       (pred_1 obj_04 obj_02)
       (pred_1 obj_04 obj_18)
       (pred_3 obj_08)
       (pred_3 obj_03)
       (pred_2  obj_08 obj_01)
       (pred_2  obj_03 obj_14)
       (pred_4 obj_19)
       (pred_4 obj_05)
       (pred_4 obj_20)
       (pred_4 obj_06)
       (pred_4 obj_12)
       (pred_4 obj_17)
       (pred_4 obj_10)
       (pred_4 obj_07)
       (pred_4 obj_09)
       (pred_4 obj_02)
       (pred_4 obj_15)
       (pred_4 obj_13)
       (pred_4 obj_18)
       (pred_4 obj_04)

       (pred_5  obj_11 obj_01)
       (pred_5  obj_16 obj_14)
       (pred_11 obj_11 obj_15)
       (pred_11 obj_16 obj_04)
       (pred_10 obj_07)
    )

    (:goal (and
       (pred_11 obj_16 obj_13)
    ))
(:constraints
  (always (not (pred_10 obj_18)))
)
)

; plan
1. (op_1 obj_07 obj_09)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_09)
   goals met: 0 of 1
2. (op_1 obj_09 obj_02)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_02)
   goals met: 0 of 1
3. (op_1 obj_02 obj_04)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_04)
   goals met: 0 of 1
4. (op_4 obj_04 obj_16)
   deleted: (pred_11 obj_16 obj_04) (pred_6)
   added: (pred_12 obj_16)
   goals met: 0 of 1
5. (op_1 obj_04 obj_02)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_02)
   goals met: 0 of 1
6. (op_1 obj_02 obj_09)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_09)
   goals met: 0 of 1
7. (op_1 obj_09 obj_07)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_07)
   goals met: 0 of 1
8. (op_1 obj_07 obj_13)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_13)
   goals met: 0 of 1
9. (op_5 obj_13 obj_16)
   deleted: (pred_12 obj_16)
   added: (pred_6) (pred_11 obj_16 obj_13)
   goals met: 1 of 1
